Revit 2024 API
Stairs.IsInEditMode Method
 Indicates whether the stairs is in edit mode or not.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsInEditMode()
Visual Basic
Public Function IsInEditMode As Boolean
Visual C++
public:
bool IsInEditMode()
See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace